
## :white_check_mark: Apply Succeeded (sakuracloud/environments/staging)

[CI link](https://github.com/FlutterKaigi/2025/actions/runs/18241125879)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.random_password.random_password.container_registry_password: Refreshing state... [id=none]
module.container_registry.sakuracloud_container_registry.registry: Refreshing state... [id=113702350470]
module.docker.docker_image.bff: Refreshing state... [id=sha256:cf9751aad95505bd7c04b97edc09661fb9ac0585a726043128d67e2e9d227a89flutterkaigi-2025-bff-staging.sakuracr.jp/bff:latest]
module.docker.docker_registry_image.bff: Refreshing state... [id=sha256:c132bc44b72cb3b64028a660cbd336568d4c4b08f5d7b1fb67ce65e3d4b86f64]
module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-bff: Refreshing state... [id=eaf109cc-1c78-413a-b170-c9e849d08fb8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker.docker_image.bff has been deleted
  - resource "docker_image" "bff" {
        id           = "sha256:cf9751aad95505bd7c04b97edc09661fb9ac0585a726043128d67e2e9d227a89flutterkaigi-2025-bff-staging.sakuracr.jp/bff:latest"
      - image_id     = "sha256:cf9751aad95505bd7c04b97edc09661fb9ac0585a726043128d67e2e9d227a89" -> null
        name         = "flutterkaigi-2025-bff-staging.sakuracr.jp/bff:latest"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-bff will be updated in-place
  ~ resource "sakuracloud_apprun_application" "flutterkaigi-2025-bff" {
        id              = "eaf109cc-1c78-413a-b170-c9e849d08fb8"
        name            = "flutterkaigi-2025-bff-staging"
        # (6 unchanged attributes hidden)

      ~ components {
            name       = "bff-staging"
            # (2 unchanged attributes hidden)

          - env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          - env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          - env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

            # (8 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.docker.docker_image.bff will be created
  + resource "docker_image" "bff" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "flutterkaigi-2025-bff-staging.sakuracr.jp/bff:latest"
      + platform     = "linux/amd64"
      + repo_digest  = (known after apply)
      + triggers     = (known after apply)

      + build {
          + cache_from     = []
          + context        = "../../modules/docker/../../../../"
          + dockerfile     = "../../modules/docker/../../../..//bff/engine/Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.docker.docker_registry_image.bff must be replaced
-/+ resource "docker_registry_image" "bff" {
      ~ id                   = "sha256:c132bc44b72cb3b64028a660cbd336568d4c4b08f5d7b1fb67ce65e3d4b86f64" -> (known after apply)
        name                 = "flutterkaigi-2025-bff-staging.sakuracr.jp/bff"
      ~ sha256_digest        = "sha256:c132bc44b72cb3b64028a660cbd336568d4c4b08f5d7b1fb67ce65e3d4b86f64" -> (known after apply)
      ~ triggers             = {
          - "image_id" = "sha256:cf9751aad95505bd7c04b97edc09661fb9ac0585a726043128d67e2e9d227a89"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
module.docker.docker_registry_image.bff: Destroying... [id=sha256:c132bc44b72cb3b64028a660cbd336568d4c4b08f5d7b1fb67ce65e3d4b86f64]
module.docker.docker_registry_image.bff: Destruction complete after 0s
module.docker.docker_image.bff: Creating...
module.docker.docker_image.bff: Still creating... [00m10s elapsed]
module.docker.docker_image.bff: Still creating... [00m20s elapsed]
module.docker.docker_image.bff: Still creating... [00m30s elapsed]
module.docker.docker_image.bff: Still creating... [00m40s elapsed]
module.docker.docker_image.bff: Still creating... [00m50s elapsed]
module.docker.docker_image.bff: Still creating... [01m00s elapsed]
module.docker.docker_image.bff: Still creating... [01m10s elapsed]
module.docker.docker_image.bff: Still creating... [01m20s elapsed]
module.docker.docker_image.bff: Still creating... [01m30s elapsed]
module.docker.docker_image.bff: Creation complete after 1m39s [id=sha256:387a78d0c9304addc8307b9c512d5185e9f71517b60fec7ea219c5e099df23faflutterkaigi-2025-bff-staging.sakuracr.jp/bff:latest]
module.docker.docker_registry_image.bff: Creating...
module.docker.docker_registry_image.bff: Still creating... [00m10s elapsed]
module.docker.docker_registry_image.bff: Still creating... [00m20s elapsed]
module.docker.docker_registry_image.bff: Creation complete after 27s [id=sha256:985b7d9db810cc9c4ffa3f3731375574e35f9941c9eb646b5d5b9c63ff6d46d0]
module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-bff: Modifying... [id=eaf109cc-1c78-413a-b170-c9e849d08fb8]
module.apprun.sakuracloud_apprun_application.flutterkaigi-2025-bff: Modifications complete after 6s [id=eaf109cc-1c78-413a-b170-c9e849d08fb8]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 1 changed, 1 destroyed.

Outputs:

container_registry_fqdn = "flutterkaigi-2025-bff-staging.sakuracr.jp"
container_registry_password = <sensitive>
container_registry_username = "registry"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":437,"Program":"tfcmt","SHA1":"cad4e41f04bf269852cd42e09e70d0999cc7ce00","Target":"sakuracloud/environments/staging","Vars":{},"WorkflowName":"Terraform Apply"} -->